myinit.org

#+STARTUP: overview
* Interface Tweaks
#+BEGIN_SRC emacs-lisp

;; 关闭启动消息
(setq inhibit-startup-message t)

;; 不显示时间
(display-time-mode 1)

;; 不显示状态栏
(setq-default mode-line-format nil) ;; mode line

;; y/n 选择和yes/no选择等效
(fset 'yes-or-no-p 'y-or-n-p)

;; 初始最大化窗口
(add-to-list 'default-frame-alist '(fullscreen . maximized)) ; maximize window
;(set-face-attribute 'default nil :family "Courier 10 Pitch" :height 140)

;; 不用tab，使用空格填充
(setq-default indent-tabs-mode nil)  ;; no tabs

;; 调整窗口快捷键
(global-set-key (kbd "<C-up>") 'shrink-window)
(global-set-key (kbd "<C-down>") 'enlarge-window)
(global-set-key (kbd "<C-left>") 'shrink-window-horizontally)
(global-set-key (kbd "<C-right>") 'enlarge-window-horizontally)

(defun show-toolbar()
  "用于显示工具栏"
  (interactive)
  (tool-bar-mode 1))

(defun hide-toolbar()
  "隐藏工具栏"
  (interactive)
  (tool-bar-mode -1))

(hide-toolbar)

(defun show-menu()
  "显示菜单栏"
  (interactive)
  (menu-bar-mode 1))

(defun hide-menu()
  "隐藏菜单栏"
  (interactive)
  (menu-bar-mode -1))

(hide-menu)

(defun show-scroll-bar()
  "显示滚动条"
  (interactive)
  (toggle-scroll-bar 1))

(defun hide-scroll-bar()
  "隐藏滚动条"
  (interactive)
  (toggle-scroll-bar -1))

(hide-scroll-bar)

(defun show-mode-line()
  "显示状态栏"
  (interactive)
  (setq-default mode-line-format t))

(defun hide-mode-line()
  "隐藏状态栏"
  (interactive)
  (setq-default mode-line-format nil))

(hide-mode-line)

(defun show-linum()
  "显示行号"
  (interactive)
  (global-linum-mode t))

(defun hide-linum()
  "隐藏行号"
  (interactive)
  (global-linum-mode -1))

;; 可以全局拷贝
(setq x-select-enable-clipboard t) ; global copy and paste


(defun nshell()
  "创建一个新的eshell"
  (interactive)
  (let ((currentbuf (get-buffer-window (current-buffer)))
	(newbuf     (generate-new-buffer-name "*shell*")))
    (generate-new-buffer newbuf)
    (set-window-dedicated-p currentbuf nil)
    (set-window-buffer currentbuf newbuf)
    (eshell newbuf)))

(defun search-web()
  "网络搜索，使用bing"
  (interactive)
  (if (and mark-active (/= (point) (mark)))
      (let ((word (buffer-substring-no-properties (region-beginning) (region-end))))
          (eww (format "http://cn.bing.com/search?q=%s" word)))
      (let ((word (thing-at-point 'word 'no-properties)))
          (if (and (not (null word)) (stringp word))
              (eww (format "http://cn.bing.com/search?q=%s" word))
              (eww "www.bing.com")))))

(defun eclear ()
  "清空当前缓冲区"
  (interactive)
  (setq inhibit-read-only t)
  (erase-buffer))

(global-set-key (kbd "C-c s") 'search-web)
(global-set-key (kbd "<f5>") 'revert-buffer)

(defun kill-other-buffers()
  "删除当前缓冲意外的所有缓冲区"
  (interactive)
  (mapc 'kill-buffer 
    (delq (current-buffer)
        (remove-if-not 'buffer-file-name (buffer-list)))))

(defun kill-all-buffers()
  "删除所有缓冲区"
  (interactive)
  (mapc 'kill-buffer (buffer-list)))

(defun set-proxy()
　"设置代理地址"
  (interactive)
  (let ((url (read-string "Please input your proxy Server Address[ip:port]: ")))
    (setf url-proxy-services
    `(("http" . ,url) ("https" . ,url)))
    (message "Proxy Server set to %s" url)))

(defun unset-proxy()
 　"取消代理"
  (interactive)
  (setf url-proxy-services nil)
  (message "Proxy Server Disabled"))
#+END_SRC
* environment variable  setup
#+BEGIN_SRC emacs-lisp
  (setenv "PATH"
          (concat   (getenv "PATH") ":"
                    "~/App/maven/bin" ":"
                    "/Applications/Mathematica.app/Contents/MacOS"))
#+END_SRC
* shell integration
#+BEGIN_SRC emacs-lisp
  (use-package validate
    :ensure t)

  (use-package exec-path-from-shell
    :ensure t
    :if (display-graphic-p)
    :config
    (validate-setq exec-path-from-shell-variables
                   '("PATH" "FULLNAME" "EMAIL" "JAVA_OPTS" "INFOPATH")))

                   
  ;(validate-setq user-full-name (getenv "FULLNAME"))
  ;(validate-setq user-mail-address (getenv "EMAIL"))
#+END_SRC
* wolfram support
** wolfram mode
#+BEGIN_SRC emacs-lisp
  (use-package wolfram-mode
    :ensure t)
#+END_SRC
* ztree
#+BEGIN_SRC emacs-lisp
(use-package ztree
    :ensure t)
#+END_SRC
* command-log-mode
#+BEGIN_SRC emacs-lisp
(use-package command-log-mode
    :ensure t)
(add-hook 'prog-mode-hook 'command-log-mode)
#+END_SRC
* Chinese Support
#+BEGIN_SRC emacs-lisp
(use-package chinese-fonts-setup
    :ensure t)
(chinese-fonts-setup-enable)
#+END_SRC
* Themes
#+BEGIN_SRC emacs-lisp
(use-package color-theme
  :ensure t)
  (use-package zenburn-theme
  :ensure t
  :config (load-theme 'zenburn t))

(defun light-on()
  (interactive)
  (load-theme 'leuven t))

(defun light-out()
  (interactive)
  (load-theme 'tsdh-dark t))

(light-out)
#+END_SRC
* pdf-tools
#+BEGIN_SRC emacs-lisp
(pdf-tools-install)
(add-hook 'pdf-tools-enabled-hook 'pdf-view-midnight-minor-mode)
#+END_SRC
* Try Package
#+BEGIN_SRC emacs-lisp
(use-package try
	:ensure t)
#+END_SRC

* which key
Brings up some help
#+BEGIN_SRC emacs-lisp
  (use-package which-key
	:ensure t 
	:config
	(which-key-mode))
#+END_SRC

* org-password-manager
#+BEGIN_SRC emacs-lisp
(use-package org-password-manager
    :ensure t
    :config
    (add-hook 'org-mode-hook 'org-password-manager-key-bindings))
#+END_SRC
* Org mode
Org bullets makes things look pretty
#+BEGIN_SRC emacs-lisp

(setenv "BROWSER" "chromium-browser")

  	(use-package org-bullets
  	:ensure t
  	:config
  	(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

        (custom-set-variables
         '(org-directory "~/Org-mode/orgfiles")
         '(org-default-notes-file (concat org-directory "/notes.org"))
         '(org-export-html-postamble nil)
         '(org-hide-leading-stars t)
         '(org-startup-folded (quote overview))
         '(org-startup-indented t)
         )

        (setq org-file-apps
    	  (append '(
    		    ("\\.pdf\\'" . "evince %s")
    		    ) org-file-apps ))

        (global-set-key "\C-c a" 'org-agenda)

        (use-package org-ac
    	    :ensure t
    	    :init (progn
    		    (require 'org-ac)
    		    (org-ac/config-default)
    		    ))

        (global-set-key (kbd "C-c c") 'org-capture)

        (setq org-agenda-files (list "~/Org-mode/orgfiles/gcal.org"
    				 "~/Org-mode/orgfiles/i.org"
    				 "~/Org-mode/orgfiles/schedule.org"))
        (setq org-capture-templates
    			    '(("a" "Appointment" entry (file  "~/Org-mode/orgfiles/gcal.org" "Appointments")
    				     "* TODO %?\n:PROPERTIES:\n\n:END:\nDEADLINE: %^T \n %i\n")
    				    ("n" "Note" entry (file+headline "~/Org-mode/orgfiles/notes.org" "Notes")
    				     "* Note %?\n%T")
    				    ("l" "Link" entry (file+headline "~/Org-mode/orgfiles/links.org" "Links")
    				     "* %? %^L %^g \n%T" :prepend t)
    				    ("b" "Blog idea" entry (file+headline "~/org-mode/orgfiles/i.org" "Blog Topics:")
    				     "* %?\n%T" :prepend t)
    				    ("t" "To Do Item" entry (file+headline "~/org-mode/orgfiles/i.org" "To Do Items")
    				     "* %?\n%T" :prepend t)

    				    ("j" "Journal" entry (file+datetree "~/Org-mode/journal.org")
    				     "* %?\nEntered on %U\n  %i\n  %a")
                                       ("s" "Screencast" entry (file "~/Org-mode/orgfiles/screencastnotes.org")
                                       "* %?\n%i\n")))


    (defadvice org-capture-finalize 
        (after delete-capture-frame activate)  
      "Advise capture-finalize to close the frame"  
      (if (equal "capture" (frame-parameter nil 'name))  
  	(delete-frame)))

    (defadvice org-capture-destroy 
        (after delete-capture-frame activate)  
      "Advise capture-destroy to close the frame"  
      (if (equal "capture" (frame-parameter nil 'name))  
  	(delete-frame)))  

    (use-package noflet
      :ensure t )
    (defun make-capture-frame ()
      "Create a new frame and run org-capture."
      (interactive)
      (make-frame '((name . "capture")))
      (select-frame-by-name "capture")
      (delete-other-windows)
      (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
        (org-capture)))
#+END_SRC

#+RESULTS:
: make-capture-frame

* Ace windows for easy window switching
#+BEGIN_SRC emacs-lisp
  (use-package ace-window
  :ensure t
  :init
  (progn
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0))))) 
    ))
#+END_SRC

