myinit.el
(setq inhibit-startup-message t)
(display-time-mode 1)
(setq-default mode-line-format nil) ;; mode line
(fset 'yes-or-no-p 'y-or-n-p)
(add-to-list 'default-frame-alist '(fullscreen . maximized)) ; maximize window
;(set-face-attribute 'default nil :family "Courier 10 Pitch" :height 140)
(setq-default indent-tabs-mode nil)  ;; no tabs

(global-set-key (kbd "<C-up>") 'shrink-window)
(global-set-key (kbd "<C-down>") 'enlarge-window)
(global-set-key (kbd "<C-left>") 'shrink-window-horizontally)
(global-set-key (kbd "<C-right>") 'enlarge-window-horizontally)

(defun show-toolbar()
  (interactive)
  (tool-bar-mode 1))
(defun hide-toolbar()
  (interactive)
  (tool-bar-mode -1))
(hide-toolbar)

(defun show-menu()
  (interactive)
  (menu-bar-mode 1))
(defun hide-menu()
  (interactive)
  (menu-bar-mode -1))
(hide-menu)

(defun show-scroll-bar()
  (interactive)
  (toggle-scroll-bar 1))
(defun hide-scroll-bar()
  (interactive)
  (toggle-scroll-bar -1))
(hide-scroll-bar)

(defun show-mode-line()
  (interactive)
  (setq-default mode-line-format t))
(defun hide-mode-line()
  (interactive)
  (setq-default mode-line-format nil))
(hide-mode-line)

(defun show-linum()
  (interactive)
  (global-linum-mode t))
(defun hide-linum()
  (interactive)
  (global-linum-mode -1))
(setq x-select-enable-clipboard t) ; global copy and paste

(defun nshell()
  (interactive)
  (let ((currentbuf (get-buffer-window (current-buffer)))
	(newbuf     (generate-new-buffer-name "*shell*")))
    (generate-new-buffer newbuf)
    (set-window-dedicated-p currentbuf nil)
    (set-window-buffer currentbuf newbuf)
    (eshell newbuf)))

(defun search-web()
  (interactive)
  (if (and mark-active (/= (point) (mark)))
      (let ((word (buffer-substring-no-properties (region-beginning) (region-end))))
          (eww (format "http://cn.bing.com/search?q=%s" word)))
      (let ((word (thing-at-point 'word 'no-properties)))
          (if (and (not (null word)) (stringp word))
              (eww (format "http://cn.bing.com/search?q=%s" word))
              (eww "www.bing.com")))))
(defun eclear ()
  (interactive)
  (setq inhibit-read-only t)
  (erase-buffer))
(global-set-key (kbd "C-c s") 'search-web)
(global-set-key (kbd "<f5>") 'revert-buffer)

(defun kill-other-buffers()
  (interactive)
  (mapc 'kill-buffer 
    (delq (current-buffer)
        (remove-if-not 'buffer-file-name (buffer-list)))))

(defun kill-all-buffers()
  (interactive)
  (mapc 'kill-buffer (buffer-list)))

(use-package ztree
    :ensure t)

(use-package command-log-mode
    :ensure t)
(add-hook 'prog-mode-hook 'command-log-mode)

(use-package chinese-fonts-setup
    :ensure t)
(chinese-fonts-setup-enable)

(use-package color-theme
  :ensure t)
  (use-package zenburn-theme
  :ensure t
  :config (load-theme 'zenburn t))

(defun light-on()
  (interactive)
  (load-theme 'leuven t))

(defun light-out()
  (interactive)
  (load-theme 'tsdh-dark t))

(light-out)

(pdf-tools-install)
(add-hook 'pdf-tools-enabled-hook 'pdf-view-midnight-minor-mode)

(use-package try
	:ensure t)

(use-package which-key
      :ensure t 
      :config
      (which-key-mode))

(use-package org-password-manager
    :ensure t
    :config
    (add-hook 'org-mode-hook 'org-password-manager-key-bindings))

(setenv "BROWSER" "chromium-browser")

  	(use-package org-bullets
  	:ensure t
  	:config
  	(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

        (custom-set-variables
         '(org-directory "~/Org-mode/orgfiles")
         '(org-default-notes-file (concat org-directory "/notes.org"))
         '(org-export-html-postamble nil)
         '(org-hide-leading-stars t)
         '(org-startup-folded (quote overview))
         '(org-startup-indented t)
         )

        (setq org-file-apps
    	  (append '(
    		    ("\\.pdf\\'" . "evince %s")
    		    ) org-file-apps ))

        (global-set-key "\C-c a" 'org-agenda)

        (use-package org-ac
    	    :ensure t
    	    :init (progn
    		    (require 'org-ac)
    		    (org-ac/config-default)
    		    ))

        (global-set-key (kbd "C-c c") 'org-capture)

        (setq org-agenda-files (list "~/Org-mode/orgfiles/gcal.org"
    				 "~/Org-mode/orgfiles/i.org"
    				 "~/Org-mode/orgfiles/schedule.org"))
        (setq org-capture-templates
    			    '(("a" "Appointment" entry (file  "~/Org-mode/orgfiles/gcal.org" "Appointments")
    				     "* TODO %?\n:PROPERTIES:\n\n:END:\nDEADLINE: %^T \n %i\n")
    				    ("n" "Note" entry (file+headline "~/Org-mode/orgfiles/notes.org" "Notes")
    				     "* Note %?\n%T")
    				    ("l" "Link" entry (file+headline "~/Org-mode/orgfiles/links.org" "Links")
    				     "* %? %^L %^g \n%T" :prepend t)
    				    ("b" "Blog idea" entry (file+headline "~/org-mode/orgfiles/i.org" "Blog Topics:")
    				     "* %?\n%T" :prepend t)
    				    ("t" "To Do Item" entry (file+headline "~/org-mode/orgfiles/i.org" "To Do Items")
    				     "* %?\n%T" :prepend t)

    				    ("j" "Journal" entry (file+datetree "~/Org-mode/journal.org")
    				     "* %?\nEntered on %U\n  %i\n  %a")
                                       ("s" "Screencast" entry (file "~/Org-mode/orgfiles/screencastnotes.org")
                                       "* %?\n%i\n")))


    (defadvice org-capture-finalize 
        (after delete-capture-frame activate)  
      "Advise capture-finalize to close the frame"  
      (if (equal "capture" (frame-parameter nil 'name))  
  	(delete-frame)))

    (defadvice org-capture-destroy 
        (after delete-capture-frame activate)  
      "Advise capture-destroy to close the frame"  
      (if (equal "capture" (frame-parameter nil 'name))  
  	(delete-frame)))  

    (use-package noflet
      :ensure t )
    (defun make-capture-frame ()
      "Create a new frame and run org-capture."
      (interactive)
      (make-frame '((name . "capture")))
      (select-frame-by-name "capture")
      (delete-other-windows)
      (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
        (org-capture)))

(use-package ace-window
:ensure t
:init
(progn
  (global-set-key [remap other-window] 'ace-window)
  (custom-set-faces
   '(aw-leading-char-face
     ((t (:inherit ace-jump-face-foreground :height 3.0))))) 
  ))
