myinit.el

(use-package counsel
  :ensure t
  :bind
  (("M-y" . counsel-yank-pop)
  :map ivy-minibuffer-map
  ("M-y" . ivy-next-line)))

(use-package ivy
  :ensure t
  :diminish (ivy-mode)
  :bind (("C-x b" . ivy-switch-buffer))
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-display-style 'fancy))


  (use-package swiper
  :ensure t
  :bind (("C-s" . swiper)
	 ("C-r" . swiper)
	 ("C-c C-r" . ivy-resume)
	 ("M-x" . counsel-M-x)
	 ("C-x C-f" . counsel-find-file))
  :config
  (progn
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (setq ivy-display-style 'fancy)
    (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
    ))

(use-package yasnippet
  :ensure t
  :init
    (yas-global-mode 1))

(use-package auto-complete
    :ensure t
    :init
    (progn
        (ac-config-default)
        (global-auto-complete-mode t)))

(use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode t))

(use-package bison-mode
    :ensure t)

(use-package autopair
    :ensure t
    :config (autopair-global-mode 1))

(use-package projectile
    :ensure t)

(use-package psvn
    :ensure t)
(setq svn-status-verbose nil)

(use-package magit
    :ensure t
    :config (global-set-key (kbd "C-c m") 'magit-status))

(use-package cmake-mode
    :ensure)

(defun my:ac-c-header-init()
    (require 'ac-c-headers)
    (add-to-list 'ac-sources 'ac-source-c-headers)
    (add-to-list 'ac-sources 'ac-source-c-header-symbols t))
(use-package ac-c-headers
    :ensure t
    :config 
    (add-hook 'c++-mode-hook 'my:ac-c-header-init)
    (add-hook 'c-mode-hook   'my:ac-c-header-init))

;; flymake-google-cpplint hook function
(defun my:flymake-google-init()
    (require 'flymake-google-cpplint)
    (custom-set-variables
        '(flymake-google-cpplint-command "/opt/cpplint-1.3.0/cpplint.py"))
    (flymake-google-cpplint-load))   

;; install flymake-google-cpplint package
(use-package flymake-google-cpplint
    :ensure t
    :config
    (add-hook 'c-mode-hook 'my:flymake-google-init)
    (add-hook 'c++-mode-hook 'my:flymake-google-init))

;; install flymake-cursor package
(use-package flymake-cursor
    :ensure t)

;; install google-c-style package
(use-package google-c-style
    :ensure t
    :config
    (add-hook 'c-mode-common-hook 'google-set-c-style)
    (add-hook 'c-mode-common-hook 'google-make-newline-indent))

(defun cedet-hook()
    (semantic-mode 1)
    (add-to-list 'ac-sources 'ac-source-semantic))

(add-hook 'c-mode-common-hook 'cedet-hook)

(use-package semantic
    :ensure t)
(use-package semantic/bovine/gcc)
(use-package semantic/ia)
(defun c-semantic-hook()
    (setq semanticdb-default-save-directory (concat  "~/.emacs.d/semanticdb"))
    (add-to-list 'semantic-default-submodes 'global-semantic-mru-bookmark-mode)
    (add-to-list 'semantic-default-submodes 'global-semanticdb-minor-mode)
    (add-to-list 'semantic-default-submodes 'global-semantic-idle-scheduler-mode)
    (add-to-list 'semantic-default-submodes 'global-semantic-highlight-func-mode)
    (semantic-mode t)
    (semantic-gcc-setup)
    (add-to-list 'ac-sources 'ac-source-functions)
    (add-to-list 'ac-sources 'ac-source-semantic))
(add-hook 'c-mode-common-hook 'c-semantic-hook)

(use-package irony
    :ensure t)

(add-hook 'c++-mode-hook 'iron-mode)
(add-hook 'c-mode-hook 'irony-mode)
(add-hook 'objc-mode-hook 'irony-mode)
(add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)

(use-package php-mode
    :ensure t)
(use-package ac-php
    :ensure t)
(defun bs-php-mode-hook()
    (auto-complete-mode t)
    (require 'ac-php)
    (setq ac-sources '(ac-source-php))
    (yas-global-mode 1)
    (setq indent-tabs-mode nil)
    (setq c-basic-offset 4)
    (setq php-template-compatibilite nil)
    (subword-mode 1))
(add-hook 'php-mode-hook 'bs-php-mode-hook)

(defun bs-web-mode-hook()
    (local-set-key '[backtab] 'indent-relative)
    (setq indent-tabs-mode nil)
    (setq web-mode-markup-indent-offset 4
          web-mode-css-indent-offset 4
          web-mode-code-indent-offset 4))
(add-hook 'web-mode-hook 'bs-web-mode-hook)

;(add-hook 'php-mode-hook 'my-php-mode-hook)
;(defun my-php-mode-hook ()
;  "My PHP mode configuration."
; (setq indent-tabs-mode nil
;        tab-width 4
;        c-basic-offset 4))

(use-package slime
    :ensure t
    :config 
    (progn
        (setq inferior-lisp-program "/usr/local/bin/sbcl")
        (setq slime-contribs '(slime-fancy))
        (require 'slime-autoloads)
        (require 'paredit)
        (add-hook 'slime-load-hook
            #'(lambda () (define-key slime-prefix-map (kbd "M-h") 'slime-documentation-lookup)))))

(use-package ac-slime
    :ensure t)

(defun lisp-hook ()
  (paredit-mode t)
  (define-key slime-prefix-map (kbd "M-h") 'slime-documentation-lookup)
  (make-variable-buffer-local 'show-paren-mode)
  (show-paren-mode 1))

(add-hook 'emacs-lisp-mode-hook 'lisp-hook)
(add-hook 'lisp-interaction-mode-hook 'lisp-hook)
(add-hook 'lisp-mode-hook 'lisp-hook)

(require 'ac-slime)
(add-hook 'slime-mode-hook 'set-up-slime-ac)
(add-hook 'slime-repl-mode-hook 'set-up-slime-ac)
(eval-after-load "auto-complete" '(add-to-list 'ac-modes 'slime-repl-mode))
(global-set-key (kbd "C-c C-h") 'slime-documentation)

(use-package paredit
    :ensure t)

(use-package clojure-mode
    :ensure t)
(use-package clojure-mode-extra-font-locking
    :ensure t)
(use-package cider
    :ensure t)

(use-package ido-completing-read+
    :ensure t)

(use-package smex
    :ensure t)

(use-package rainbow-delimiters
    :ensure t)

(use-package tagedit
    :ensure t)

(use-package nasm-mode
    :ensure t
    :config 
    (progn (add-to-list 'auto-mode-alist '("\\.\\(asm\\|s\\)$" . nasm-mode))))

(use-package avy
:ensure t
:bind ("M-s" . avy-goto-word-1)) ;; changed from char as per jcs

(use-package neotree
    :ensure t
    :bind (("C-c d" . neotree-toggle))
    :config
    (setq neo-smart-open t))

(use-package bing-dict
    :ensure t
    :bind 
    (("C-x t" . bing-dict-brief))
)

(use-package cal-china-x
    :ensure t
    :config
    (progn 
        (setq mark-holidays-in-calendar t)
        (setq cal-china-x-important-holidays cal-china-x-chinese-holidays)
        (setq calendar-holidays cal-china-x-important-holidays)))

(use-package ox-reveal
:ensure ox-reveal)

(setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
(setq org-reveal-mathjax t)

(use-package htmlize
:ensure t)

(use-package undo-tree
  :ensure t
  :init
  (global-undo-tree-mode))
